nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_qtmr.h
/*!
 * @brief The enumeration for Quad Timer channel primary input source.
 */
typedef enum _qtmr_channel_primary_count_source
{
    kQTMR_PrimarySrcInputPin0 = 0,      /*!< Quad Timer input pin 0. */
    kQTMR_PrimarySrcInputPin1,          /*!< Quad Timer input pin 1. */
    kQTMR_PrimarySrcInputPin2,          /*!< Quad Timer input pin 2. */
    kQTMR_PrimarySrcInputPin3,          /*!< Quad Timer input pin 3. */
    kQTMR_PrimarySrcChannel0Output,     /*!< Quad Timer channel 0 output. */
    kQTMR_PrimarySrcChannel1Output,     /*!< Quad Timer channel 1 output. */
    kQTMR_PrimarySrcChannel2Output,     /*!< Quad Timer channel 2 output. */
    kQTMR_PrimarySrcChannel3Output,     /*!< Quad Timer channel 3 output. */
    kQTMR_PrimarySrcIPBusClockDivide1,  /*!< IP bus clock divide by 1. */
    kQTMR_PrimarySrcIPBusClockDivide2,  /*!< IP bus clock divide by 2. */
    kQTMR_PrimarySrcIPBusClockDivide4,  /*!< IP bus clock divide by 4. */
    kQTMR_PrimarySrcIPBusClockDivide8,  /*!< IP bus clock divide by 8. */
    kQTMR_PrimarySrcIPBusClockDivide16, /*!< IP bus clock divide by 16. */
    kQTMR_PrimarySrcIPBusClockDivide32, /*!< IP bus clock divide by 32. */
    kQTMR_PrimarySrcIPBusClockDivide64, /*!< IP bus clock divide by 64. */
    kQTMR_PrimarySrcIPBusClockDivide128 /*!< IP bus clock divide by 128. */
} qtmr_channel_primary_count_source_t;

/*!
 * @brief The enumeration for Quad Timer channel secondary input source.
 */
typedef enum _qtmr_channel_secondary_count_source
{
    kQTMR_SecondarySrcInputPin0 = 0, /*!< Quad Timer input pin 0. */
    kQTMR_SecondarySrcInputPin1,     /*!< Quad Timer input pin 1. */
    kQTMR_SecondarySrcInputPin2,     /*!< Quad Timer input pin 2. */
    kQTMR_SecondarySrcInputPin3      /*!< Quad Timer input pin 3. */
} qtmr_channel_secondary_count_source_t;

/*!
 * @brief The enumeration for Quad Timer channel secondary input source capture mode.
 */
typedef enum _qtmr_channel_secondary_source_capture_mode
{
    kQTMR_SecondarySrcCaptureNoCapture = 0,            /*!< Secondary source capture is disabled. */
    kQTMR_SecondarySrcCaptureRisingEdge,               /*!< Secondary source capture on rising edge. */
    kQTMR_SecondarySrcCaptureFallingEdge,              /*!< Secondary source capture on falling edge. */
    kQTMR_SecondarySrcCaptureRisingAndFallingEdge,     /*!< Secondary source capture on both edges. */
    kQTMR_SecondarySrcCaptureRisingEdgeWithReload = 5, /*!< Secondary source capture on rising edge while cause the
                                                          channel to be reloaded. */
    kQTMR_SecondarySrcCaptureFallingEdgeWithReload,    /*!< Secondary source capture on falling edge while cause the
                                                          channel to be reloaded. */
    kQTMR_SecondarySrcCaptureRisingAndFallingEdgeWithReload /*!< Secondary source capture on both edges while cause
                                                               the channel to be reloaded. */
} qtmr_channel_secondary_source_capture_mode_t;

/*!
 * @brief The enumeration for Quad Timer channel count mode.
 *
 * When "channel output 0~3" or "IP bus clock prescaler" is chosen, active edge is the rising edge. When "input pin 0~3"
 * is chosen, active edge and active level is determined by input invert feature (IPS). Disable input invert feature
 * means active edge is rising edge, active level is high level, enable input invert feature means active edge is
 * falling edge, active level is low level.
 */
typedef enum _qtmr_channel_count_mode
{
    kQTMR_CountNoOperation = 0,                      /*!< No operation. */
    kQTMR_CountPrimarySrcRiseEdge,                   /*!< Count active edge of primary input source. */
    kQTMR_CountPrimarySrcRiseAndFallEdge,            /*!< Count rising and falling edges of primary input source. */
    kQTMR_CountPrimarySrcRiseEdgeSecondarySrcInHigh, /*!< Count active edge of primary input source when secondary input
                                                        is at a active level. */
    kQTMR_CountPrimarySecondarySrcInQuadDecode,      /*!< Quadrature count mode, uses primary and secondary sources. */
    kQTMR_CountPrimarySrcRiseEdgeSecondarySrcDir, /*!< Count active edge of primary input source; secondary input source
                                                     specifies count direction. */
    kQTMR_CountPrimarySrcRiseEdgeSecondarySrcRiseEdgeTrig, /*!< The active edge of secondary input source triggers count
                                                              active edge of primary input source, and the channel
                                                              counter will stop upon receiving a second trigger event
                                                              while it's still counting from the first trigger event.*/
    kQTMR_CountCascadeWithOtherChannel, /*!< Cascaded count mode, the channel will count as compare events occur in the
                                             selected source chennel (use a special high-speed signal path rather than
                                             the OFLAG output signal). */
    /*!< The active edge of secondary input source triggers count active edge of primary input source, and the channel
       counter will re-initialized upon receiving a second trigger event while it's still counting from the first
       trigger event. */
    kQTMR_CountPrimarySrcRiseEdgeSecondarySrcRiseEdgeTrigWithReInit =
        (0x8 | kQTMR_CountPrimarySrcRiseEdgeSecondarySrcRiseEdgeTrig)
} qtmr_channel_count_mode_t;

/*!
 * @brief The enumeration for Quad Timer channel count length.
 */
typedef enum _qtmr_channel_count_length
{
    kQTMR_CountLengthUntilRollOver = 0, /*!< Count until roll over at $FFFF. */
    kQTMR_CountLengthUntilCompare,      /*!< Count until compare. */
} qtmr_channel_count_length_t;

/*!
 * @brief The enumeration for Quad Timer channel count direction.
 */
typedef enum _qtmr_channel_count_direction
{
    kQTMR_CountDirectionUp = 0, /*!< Count direction up. */
    kQTMR_CountDirectionDown,   /*!< Count direction down. */
} qtmr_channel_count_direction_t;

/*!
 * @brief The enumeration for Quad Timer channel count times.
 */
typedef enum _qtmr_channel_count_times
{
    kQTMR_CountTimesRepeat = 0, /*!< Count repeatedly. */
    kQTMR_CountTimesOnce,       /*!< Count time once. */
} qtmr_channel_count_times_t;

/*!
 * @brief The enumeration for Quad Timer channel count load mode.
 */
typedef enum _qtmr_channel_count_load_mode
{
    kQTMR_CountLoadNormal = 0,  /*!< Count can be re-initialized only with the LOAD register when match event occurs. */
    kQTMR_CountLoadAlternative, /*!< Channel can be re-initialized with the LOAD register when count up and a match with
                                   COMP1 occurs, or with CMPLD2 register when count down and a match with COMP2 occurs.
                                 */
} qtmr_channel_count_load_mode_t;

/*!
 * @brief The enumeration for Quad Timer channel COMP1 & COMP2 preload mode.
 */
typedef enum _qtmr_channel_count_preload_mode
{
    kQTMR_CountPreloadNoLoad = 0,          /*!< Not load CMPLDn into COMPn register when compare event occurs. */
    kQTMR_CountPreloadOnComp1CompareEvent, /*!< Load CMPLDn register into COMPn when occurs a successful comparison of
                                         channel counter value and the COMP1 register. */
    kQTMR_CountPreloadOnComp2CompareEvent  /*!< Load CMPLDn register into COMPn when occurs a successful comparison of
                                         channel counter value and the COMP2  register. */
} qtmr_channel_count_preload_mode_t;

/*!
 * @brief The enumeration for Quad Timer channel output signal (OFLAG signal) work mode.
 */
typedef enum _qtmr_channel_output_mode
{
    kQTMR_OutputAssertWhenCountActive = 0,          /*!< OFLAG output assert while counter is active. */
    kQTMR_OutputClearOnCompare,                     /*!< OFLAG output clear on successful compare. */
    kQTMR_OutputSetOnCompare,                       /*!< OFLAG output set on successful compare. */
    kQTMR_OutputToggleOnCompare,                    /*!< OFLAG output toggle on successful compare. */
    kQTMR_OutputToggleOnAltCompareReg,              /*!< OFLAG output toggle using alternating compare registers. */
    kQTMR_OutputSetOnComareClearOnSecSrcActiveEdge, /*!< OFLAG output set on compare, clear on secondary source input
                                                       edge. */
    kQTMR_OutputSetOnCompareClearOnCountRoll,       /*!< OFLAG output set on compare, clear on counter rollover. */
    kQTMR_OutputGateClockOutWhenCountActive         /*!< OFLAG output gated while count is active. */
} qtmr_channel_output_mode_t;

/*!
 * @brief The enumeration for Quad Timer channel output signal (OFLAG) value on force event occur.
 */
typedef enum _qtmr_qtmr_channel_output_value_on_force
{
    kQTMR_OutputValueClearOnForce = 0, /*!< OFLAG output clear (low) when software triggers a FORCE command or master
                                          channel force the OFLAG (EEOF need set). */
    kQTMR_OutputValueSetOnForce, /*!< OFLAG output set (high) when software triggers a FORCE command or master channel
                                    force the OFLAG (EEOF need set). */
} qtmr_channel_output_value_on_force_t;

/*!
 * @brief The enumeration for Quad Timer channel run options when the chip entering debug mode.
 */
typedef enum _qtmr_channel_debug_action
{
    kQTMR_DebugRunNormal = 0U,       /*!< Continue with normal operation. */
    kQTMR_DebugHaltCounter,          /*!< Halt counter. */
    kQTMR_DebugForceOutToZero,       /*!< Force output to logic 0. */
    kQTMR_DebugHaltCountForceOutZero /*!< Halt counter and force output to logic 0. */
} qtmr_channel_debug_action_t;

/*!
 * @brief The enumeration for Quad Timer channel interrupts.
 */
enum _qtmr_channel_interrupt_enable
{
    kQTMR_CompareInterruptEnable  = (TMR_SCTRL_TCFIE_MASK),   /*!< Compare interrupt. */
    kQTMR_Compare1InterruptEnable = (TMR_CSCTRL_TCF1EN_MASK), /*!< Compare 1 interrupt. */
    kQTMR_Compare2InterruptEnable = (TMR_CSCTRL_TCF2EN_MASK), /*!< Compare 2 interrupt. */
    kQTMR_OverflowInterruptEnable = (TMR_SCTRL_TOFIE_MASK),   /*!< Timer overflow interrupt. */
    kQTMR_EdgeInterruptEnable     = (TMR_SCTRL_IEFIE_MASK),   /*!< Input edge interrupt. */
    kQTMR_ALLInterruptEnable =
        (kQTMR_CompareInterruptEnable | kQTMR_Compare1InterruptEnable | kQTMR_Compare2InterruptEnable |
         kQTMR_OverflowInterruptEnable | kQTMR_EdgeInterruptEnable),
};

/*!
 * @brief The enumeration for Quad Timer channel work status.
 */
enum _qtmr_channel_status_flags
{
    kQTMR_CompareFlag  = TMR_SCTRL_TCF_MASK,   /*!< Compare flag. */
    kQTMR_Compare1Flag = TMR_CSCTRL_TCF1_MASK, /*!< Compare 1 flag. */
    kQTMR_Compare2Flag = TMR_CSCTRL_TCF2_MASK, /*!< Compare 2 flag. */
    kQTMR_OverflowFlag = TMR_SCTRL_TOF_MASK,   /*!< Timer overflow flag. */
    kQTMR_EdgeFlag     = TMR_SCTRL_IEF_MASK,   /*!< Input edge flag. */
    kQTMR_StatusAllFlags =
        kQTMR_CompareFlag | kQTMR_Compare1Flag | kQTMR_Compare2Flag | kQTMR_OverflowFlag | kQTMR_EdgeFlag,
};

/*!
 * @brief The enumeration for Quad Timer channel enable.
 */
enum _qtmr_channel_enable
{
    kQTMR_Channel0Enable = (1 << 0U), /*!< Channel 0 enable. */
    kQTMR_Channel1Enable = (1 << 1U), /*!< Channel 1 enable. */
    kQTMR_Channel2Enable = (1 << 2U), /*!< Channel 2 enable. */
    kQTMR_Channel3Enable = (1 << 3U), /*!< Channel 3 enable. */
    kQTMR_ALLChannelEnable =
        (kQTMR_Channel0Enable | kQTMR_Channel1Enable | kQTMR_Channel2Enable | kQTMR_Channel3Enable),
};

/*!
 * @brief The enumeration for Quad Timer channel DMA trigger source.
 */
enum _qtmr_channel_dma_enable
{
    kQTMR_InputEdgeFlagDmaEnable = (TMR_DMA_IEFDE_MASK), /*!< Input edge flag setting will trigger DMA read request for
                                                            CAPT register. */
    kQTMR_Compare1PreloadDmaEnable = (TMR_DMA_CMPLD1DE_MASK), /*!< Channel load CMPLD1 register into COMP1 will trigger
                                                                 DMA write request for CMPLD1. */
    kQTMR_Compare2PreloadDmaEnable = (TMR_DMA_CMPLD2DE_MASK), /*!< Channel load CMPLD2 register into COMP2 will trigger
                                                                 DMA write request for CMPLD2. */
    kQTMR_AllDMAEnable = kQTMR_InputEdgeFlagDmaEnable | kQTMR_Compare1PreloadDmaEnable | kQTMR_Compare2PreloadDmaEnable,
};

/*!
 * @brief The structure for configuring Quad Timer channel input signal.
 */
typedef struct _qtmr_channel_input_config
{
    qtmr_channel_primary_count_source_t ePrimarySource : 4U;     /*!< Specify the primary input source. */
    qtmr_channel_secondary_count_source_t eSecondarySource : 2U; /*!< Specify the secondary input source. */
    /* Configures the secondary input source capture mode. */
    qtmr_channel_secondary_source_capture_mode_t eSecondarySourceCaptureMode : 3U;
    bool bEnableSecondarySrcFaultFunction : 1U; /*!< true: The selected secondary input acts as a fault signal which can
                               clear the channel output signal when it is set, false: Fault function disabled. */
    bool eEnableInputInvert : 1U; /*!< true: Invert input signal value when select input pin as primary or/and secondary
                                input source false: no operation. */
} qtmr_channel_input_config_t;

/*!
 * @brief The structure for configuring Quad Timer channel counting behaviors.
 */
typedef struct _qtmr_channel_count_config
{
    qtmr_channel_count_mode_t eCountMode : 4U;          /*!< Configures channel count mode. */
    qtmr_channel_count_length_t eCountLength : 1U;      /*!< Configures channel count length. */
    qtmr_channel_count_direction_t eCountDir : 1U;      /*!< Configures channel count direction. */
    qtmr_channel_count_times_t eCountTimes : 1U;        /*!< Configures channel count times. */
    qtmr_channel_count_load_mode_t eCountLoadMode : 1U; /*!< Configures channel count load mode. */
    /* Configures channel count compare register 1 preload control. */
    qtmr_channel_count_preload_mode_t eCountPreload1 : 2U;
    /* Configures channel count compare register 2 preload control. */
    qtmr_channel_count_preload_mode_t eCountPreload2 : 2U;
    uint8_t bitsReserved : 4U;
} qtmr_channel_count_config_t;

/*!
 * @brief The structure for configuring Quad Timer channel output signal (OFLAG).
 */
typedef struct _qtmr_channel_output_config
{
    qtmr_channel_output_mode_t eOutputMode : 3U;                   /*!< Configures channel output signal work mode. */
    qtmr_channel_output_value_on_force_t eOutputValueOnForce : 1U; /*!< The value of output signal when
                                                                     force event occur. */
    bool bEnableOutputInvert : 1U;  /*!< True: the polarity of output signal will be inverted, false: The
                                       output signal is not inverted. */
    bool bEnableSwForceOutput : 1U; /*!< True: forces the current value of eOFLAGValueOnForce to output signal. false:
                                      no operation. */
    bool bEnableOutputPin : 1U;     /*!< True: the output signal is driven on the external pin. false: the external
                                        pin is configured as an input. */
    uint8_t bitReserved : 1U;
} qtmr_channel_output_config_t;

/*!
 * @brief The structure for configuring Quad Timer channel cooperation mode with other channels.
 */
typedef struct _qtmr_channel_cooperation_config
{
    bool bEnableMasterReInit : 1U;     /*!< true: Master channel within the module can re-initialize this
                                       channel when it has a compare event, false: no operation. */
    bool bEnableMasterForceOFLAG : 1U; /*!< true: Master channel within the module can force this channel OFLAG signal
                                        when it has a compare event, false: no operation. */
    bool bEnableMasterMode : 1U; /*!< true: This channel is configured as mater channel, it can broadcast compare event
                                  to all channels within the module to re-initialize channel and/or force channel output
                                  signal, false: no operation. */
    uint8_t bitsReserved : 5U;
} qtmr_channel_cooperation_config_t;

/*!
 * @brief Quad Timer channel configuration covering all channel configurable fields.
 */
typedef struct _qtmr_channel_config
{
    qtmr_channel_input_config_t sInputConfig;   /*!< Configures channel input signal. */
    qtmr_channel_count_config_t sCountConfig;   /*!< Configures channel count work mode. */
    qtmr_channel_output_config_t sOutputConfig; /*!< Configures channel output signal (OFLAG) work mode. */
    /* Configures channel cooperation mode with other channels. */
    qtmr_channel_cooperation_config_t sCooperationConfig;
    qtmr_channel_debug_action_t eDebugMode; /*!< Configures channel operation in chip debug mode. */
    uint16_t u16EnabledInterruptMask;       /*!< The mask of the interrupts to be enabled, should be the OR'ed of
                                              @ref _qtmr_channel_interrupt_enable. */
    uint16_t u16EnabledDMAMask;             /*!< The mask of the interrupts to be enabled, should be the OR'ed of
                                              @ref _qtmr_channel_dma_enable. */
    uint16_t u16Comp1;                      /*!< Value for Channel compare register 1. */
    uint16_t u16Comp2;                      /*!< Value for Channel compare register 2. */
    uint16_t u16Comp1Preload;               /*!< Value for Channel compare 1 preload register. */
    uint16_t u16Comp2Preload;               /*!< Value for Channel compare 2 preload register. */
    uint16_t u16Load;                       /*!< Value for Channel load register. */
    uint16_t u16Count;                      /*!< Value for Channel counter value register. */
    bool bEnableChannel;                    /*!< True: enable the channel prescaler (if it is being used) and counter
                                                 false: disable channel. */
} qtmr_channel_config_t;

/*!
 * @brief The structure for configuring Quad Timer module input pin filter.
 */
typedef struct _qtmr_input_pin_filter_config
{
    uint8_t u8Period; /*!< Value for input filter sample period. */
    uint8_t u8Count;  /*!< Value for input filter sample count (sample count = count +3). */
} qtmr_input_pin_filter_config_t;

/*!
 * @brief Quad Timer module configuration which contain channel config structure pointers and input pin
 *        filter config structure pointers.
 *
 * @note Need use channel structure address to init the structure pointers, when the channel or input pin structure
 *       pointers is NULL, it will be ignored by QTMR_Init API. This can save stack space when only one or two channels
 *       are used.
 */
typedef struct _qtmr_config
{
    qtmr_channel_config_t *psChannelConfig[4];
    qtmr_input_pin_filter_config_t *psInputFilterConfig[4];
} qtmr_config_t;

