nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_qtmr.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name Initialization and deinitialization Interfaces
 * @{
 */

/*!
 * @brief Initialization Quad Timer module with provided structure.
 *
 * This function can initial one or more channels of the Quad Timer module.
 *
 * This examples shows how only initial channel 0.
 * @code
 *     qtmr_config_t sConfig = {0};
 *     qtmr_channel_config_t sChannel0Config;
 *     sConfig.psChannelConfig[0] = &sChannel0Config;
 *     QTMR_GetChannelDefaultConfig(&sChannel0Config);
 *     QTMR_Init(QTMR, sConfig);
 * @endcode
 *
 * @note This API should be called at the beginning of the application using the Quad Timer module.
 *
 * @param base      Quad Timer peripheral base address.
 * @param psConfig  Pointer to user's Quad Timer config structure. See @ref qtmr_config_t.
 */
void QTMR_Init(TMR_Type *base, const qtmr_config_t *psConfig);

/*!
 * @brief De-initialization Quad Timer module.
 *
 * @param base  Quad Timer peripheral base address.
 */
void QTMR_Deinit(TMR_Type *base);

/*!
 * @brief Gets an available pre-defined options for Quad Timer channel module's configuration.
 *
 * This function initializes the channel configuration structure with a free run 16bit timer work setting.
 * The default values are:
 * @code
 *   psConfig->sInputConfig.ePrimarySource = kQTMR_PrimarySrcIPBusClockDivide2;
 *   psConfig->sInputConfig.eSecondarySource = kQTMR_SecondarySrcInputPin0;
 *   psConfig->sInputConfig.eSecondarySourceCaptureMode = kQTMR_SecondarySrcCaptureNoCapture;
 *   psConfig->sInputConfig.bEnableSecondarySrcFaultFunction = false;
 *   psConfig->sInputConfig.eEnableInputInvert = false;
 *   psConfig->sCountConfig.eCountMode = kQTMR_CountPrimarySrcRiseEdge;
 *   psConfig->sCountConfig.eCountLength = kQTMR_CountLengthUntilRollOver;
 *   psConfig->sCountConfig.eCountDir = kQTMR_CountDirectionUp;
 *   psConfig->sCountConfig.eCountTimes = kQTMR_CountTimesRepeat;
 *   psConfig->sCountConfig.eCountLoadMode = kQTMR_CountLoadNormal;
 *   psConfig->sCountConfig.eCountPreload1 = kQTMR_CountPreloadNoLoad;
 *   psConfig->sCountConfig.eCountPreload2 = kQTMR_CountPreloadNoLoad;
 *   psConfig->sOutputConfig.eOutputMode = kQTMR_OutputAssertWhenCountActive;
 *   psConfig->sOutputConfig.eOutputValueOnForce = kQTMR_OutputValueClearOnForce;
 *   psConfig->sOutputConfig.bEnableOutputInvert = false;
 *   psConfig->sOutputConfig.bEnableSwForceOutput = false;
 *   psConfig->sOutputConfig.bEnableOutputPin = false;
 *   psConfig->sCooperationConfig.bEnableMasterReInit = false;
 *   psConfig->sCooperationConfig.bEnableMasterForceOFLAG = false;
 *   psConfig->sCooperationConfig.bEnableMasterMode = false;
 *   psConfig->eDebugMode = kQTMR_DebugRunNormal;
 *   psConfig->u16EnabledInterruptMask = 0x0U;
 *   psConfig->u16EnabledDMAMask = 0x0U;
 *   psConfig->u16Comp1 = 0x0U;
 *   psConfig->u16Comp2 = 0x0U;
 *   psConfig->u16Comp1Preload = 0x0U;
 *   psConfig->u16Comp1Preload = 0x0U;
 *   psConfig->u16Load = 0x0U;
 *   psConfig->u16Count = 0x0U;
 *   psConfig->bEnableChannel = false;
 * @endcode
 *
 * @param psConfig  Pointer to user's Quad Timer channel config structure. See @ref qtmr_channel_config_t.
 */
void QTMR_GetChannelDefaultConfig(qtmr_channel_config_t *psConfig);

/*!
 * @brief Setup a Quad Timer channel with provided structure.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param psConfig        Pointer to user's Quad Timer channel config structure. See @ref qtmr_channel_config_t.
 */
void QTMR_SetupChannleConfig(TMR_Type *base,
                             qtmr_channel_number_t eChannelNumber,
                             const qtmr_channel_config_t *psConfig);

/*! @}*/

/*!
 * @name Input signal control related Interfaces
 * @{
 */

/*!
 * @brief Sets primary input source.
 *
 * This function select the primary input source, it can select from "input pin 0~3", "channel output
 * 0~3" and "IP bus clock prescaler".
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param ePrimarySource  The primary input source. See @ref qtmr_channel_primary_count_source_t.
 */
static inline void QTMR_SetPrimaryCountSource(TMR_Type *base,
                                              qtmr_channel_number_t eChannelNumber,
                                              qtmr_channel_primary_count_source_t ePrimarySource)
{
    base->CHANNEL[eChannelNumber].CTRL =
        (base->CHANNEL[eChannelNumber].CTRL & (uint16_t)(~TMR_CTRL_PCS_MASK)) | TMR_CTRL_PCS(ePrimarySource);
}

/*!
 * @brief Sets secondary input source.
 *
 * This function select the secondary input source, it can select from "input pin 0~3".
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param source          The Secondary input source. See @ref qtmr_secondary_count_source_t.
 */
static inline void QTMR_SetSecondaryCountSource(TMR_Type *base,
                                                qtmr_channel_number_t eChannelNumber,
                                                qtmr_channel_secondary_count_source_t source)
{
    base->CHANNEL[eChannelNumber].CTRL =
        (base->CHANNEL[eChannelNumber].CTRL & (uint16_t)(~TMR_CTRL_SCS_MASK)) | TMR_CTRL_SCS(source);
}

/*!
 * @brief Sets secondary input capture mode.
 *
 * This function select the capture mode for secondary input, it can select from "disable capture", "capture on
 * rising/falling edge" and "capture on both edges". Need enable capture mode when input edge interrupt is needed.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param eCaptureMode    The capture mode of secondary input. See @ref qtmr_channel_secondary_source_capture_mode_t.
 */
void QTMR_SetSecondarySourceInputCaptureMode(TMR_Type *base,
                                             qtmr_channel_number_t eChannelNumber,
                                             qtmr_channel_secondary_source_capture_mode_t eCaptureMode);

/*!
 * @brief Enables/Disables secondary input source signal fault feature.
 *
 * Enable fault feature will make secondary input acts as a fault signal so that the channel output signal (OFLAG) is
 * cleared when the secondary input is set.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param bEnable         Enable the feature or not.
 *                        - \b true Enable secondary source fault feature.
 *                        - \b false Disable secondary source fault feature.
 */
static inline void QTMR_EnableSecondarySourceFault(TMR_Type *base, qtmr_channel_number_t eChannelNumber, bool bEnable)
{
    if (bEnable)
    {
        base->CHANNEL[eChannelNumber].CSCTRL |= (uint16_t)(TMR_CSCTRL_FAULT_MASK);
    }
    else
    {
        base->CHANNEL[eChannelNumber].CSCTRL &= (uint16_t)(~(TMR_CSCTRL_FAULT_MASK));
    }
}

/*!
 * @brief Enables/Disables input pin signal polarity invert feature.
 *
 * This function enables/disables input pin signal polarity invert feature.
 * @note Invert feature only affects "input pin 0~3", and acts on the channel input node, not the input pin, so it
 *       only affect current channel and not share by other channel
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param bEnable         Enable the feature or not.
 *                        - \b true Invert input pin signal polarity.
 *                        - \b false No invert for input pin signal polarity.
 */
static inline void QTMR_EnableInputInvert(TMR_Type *base, qtmr_channel_number_t eChannelNumber, bool bEnable)
{
    if (bEnable)
    {
        base->CHANNEL[eChannelNumber].SCTRL &= ~(uint16_t)(TMR_SCTRL_IPS_MASK);
    }
    else
    {
        base->CHANNEL[eChannelNumber].SCTRL |= (uint16_t)(TMR_SCTRL_IPS_MASK);
    }
}

/*!
 * @brief Sets input filter for one input pin.
 *
 * Sets input filter if the input signal is noisy.
 * @note The input filter acts on the input pin directly, so the input filter config will affect all channels that
 *       select this input pin as source. Turning on the input filter(setting FILT_PER to a non-zero value) introduces a
 *       latency of (((u8Count + 3) x u8Period) + 2) IP bus clock periods.
 *
 * @param base      Quad Timer peripheral base address.
 * @param ePin      Quad Timer input pin number. See @ref qtmr_input_pin_t.
 * @param u8Count   Range is 0~7, represent the number of consecutive samples that must agree prior to the input filter
 *                  accepting an input transition. Actual consecutive samples numbers is (u8Count + 3).
 * @param u8Period  Represent the sampling period (in IP bus clock cycles) of the input pin signals. Each input is
 *                  sampled multiple times at the rate specified by this field. If u8Period is 0, then the input pin
 *                  filter is bypassed.
 */
static inline void QTMR_SetInputFilter(TMR_Type *base, qtmr_input_pin_t ePin, uint8_t u8Count, uint8_t u8Period)
{
    assert(u8Count <= TMR_FILT_FILT_CNT_MASK);
    /* Setup new input filter */
    base->CHANNEL[ePin].FILT = (TMR_FILT_FILT_CNT(u8Count) | TMR_FILT_FILT_PER(u8Period));
}

/*!
 * @brief Gets the external input signal value selected via the secondary input source.
 *
 * This function read the value of the secondary input source, the input pin IPS and filtering have been applied to the
 * read back value.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 *
 * @return The state of the current state of the external input pin selected via the secondary count
 *         source after application of IPS and filtering.
 */
static inline uint16_t QTMR_GetInputPinValueInSecondarySource(TMR_Type *base, qtmr_channel_number_t eChannelNumber)
{
    return ((base->CHANNEL[eChannelNumber].SCTRL & TMR_SCTRL_INPUT_MASK) >> TMR_SCTRL_INPUT_SHIFT);
}

/*! @}*/

/*!
 * @name Channel count related Interfaces
 * @{
 */

/*!
 * @brief Sets channel count mode.
 *
 * This function select channel basic count mode which trigger by primary input or/and secondary input events.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param eCountMode      The mode of operation for the count. See @ref qtmr_counting_mode_t.
 */
void QTMR_SetCountMode(TMR_Type *base, qtmr_channel_number_t eChannelNumber, qtmr_channel_count_mode_t eCountMode);

/*!
 * @brief Sets channel count length.
 *
 * This function select channel single count length from "until roll over" or "until compare". "until roll over" means
 * count until 0xFFFF, "until compare" means count until reach COMP1 (for count up) or COMP2 (for count up) value
 * (unless the output signal is in alternating compare mode, this mode make channel use COMP1 and COMP2 alternately).
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param eLength         The channel count length. See @ref qtmr_channel_count_length_t.
 */
static inline void QTMR_SetCountLength(TMR_Type *base,
                                       qtmr_channel_number_t eChannelNumber,
                                       qtmr_channel_count_length_t eLength)
{
    if (eLength == kQTMR_CountLengthUntilCompare)
    {
        base->CHANNEL[eChannelNumber].CTRL |= (uint16_t)(TMR_CTRL_LENGTH_MASK);
    }
    else
    {
        base->CHANNEL[eChannelNumber].CTRL &= ~(uint16_t)(TMR_CTRL_LENGTH_MASK);
    }
}

/*!
 * @brief Sets channel count direction.
 *
 * This function select channel count direction from "count up" or "count down". Under normal count mode, this function
 * decide the count direction directly, when chose "secondary specifies direction" count mode, count direction decide by
 * "the secondary input level" XOR with "the function selection".
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param eDirection      The channel count direction. See @ref qtmr_channel_count_direction_t.
 */
static inline void QTMR_SetCountDirection(TMR_Type *base,
                                          qtmr_channel_number_t eChannelNumber,
                                          qtmr_channel_count_direction_t eDirection)
{
    if (eDirection == kQTMR_CountDirectionDown)
    {
        base->CHANNEL[eChannelNumber].CTRL |= (uint16_t)(TMR_CTRL_DIR_MASK);
    }
    else
    {
        base->CHANNEL[eChannelNumber].CTRL &= ~(uint16_t)(TMR_CTRL_DIR_MASK);
    }
}

/*!
 * @brief Gets channel count direction.
 *
 * This function read the channel count direction of the last count during quadrature encoded count mode.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 *
 * @return The direction of the last count. Value see @ref qtmr_channel_count_direction_t.
 */
static inline qtmr_channel_count_direction_t QTMR_GetCountDirection(TMR_Type *base,
                                                                    qtmr_channel_number_t eChannelNumber)
{
    return (((base->CHANNEL[eChannelNumber].CSCTRL & TMR_CSCTRL_UP_MASK) != 0U) ? kQTMR_CountDirectionUp :
                                                                                  kQTMR_CountDirectionDown);
}

/*!
 * @brief Sets channel count times.
 *
 * This function select channel count times from "once" or "repeatedly". If select "once" with "until compare", channel
 * will stop when reach COMP1 (for count up) or COMP2 (for count up) (unless the output signal is in alternating compare
 * mode, this mode will make channel reaching COMP1, re-initializes then count reaching COMP2, and then stops).
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param eTimes          The channel count times. See @ref qtmr_channel_count_times_t.
 */
static inline void QTMR_SetCountTimes(TMR_Type *base,
                                      qtmr_channel_number_t eChannelNumber,
                                      qtmr_channel_count_times_t eTimes)
{
    if (eTimes == kQTMR_CountTimesOnce)
    {
        base->CHANNEL[eChannelNumber].CTRL |= (uint16_t)(TMR_CTRL_ONCE_MASK);
    }
    else
    {
        base->CHANNEL[eChannelNumber].CTRL &= ~(uint16_t)(TMR_CTRL_ONCE_MASK);
    }
}

/*!
 * @brief Sets channel count load mode.
 *
 * This function select channel count re-initialized load mode from "normal" or "alternative". "normal" means channel
 * counter re-initialized from LOAD register when compare event, "alternative" means channel counter can
 * re-initialized from LOAD (count up) or CMPLD2 (count down) when compare event.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param eLoadMode       The channel count load mode. See @ref qtmr_channel_count_load_mode_t.
 */
static inline void QTMR_SetCountLoadMode(TMR_Type *base,
                                         qtmr_channel_number_t eChannelNumber,
                                         qtmr_channel_count_load_mode_t eLoadMode)
{
    if (eLoadMode == kQTMR_CountLoadAlternative)
    {
        base->CHANNEL[eChannelNumber].CSCTRL |= (uint16_t)(TMR_CSCTRL_ALT_LOAD_MASK);
    }
    else
    {
        base->CHANNEL[eChannelNumber].CSCTRL &= ~(uint16_t)(TMR_CSCTRL_ALT_LOAD_MASK);
    }
}

/*!
 * @brief Sets channel preload mode for compare register 1.
 *
 * This function select channel preload mode for compare register 1. Default the COMP1 register never preload, when
 * enabled, the COMP1 can preload from CMPLD1 register when COMP1 or COMP2 compare event.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param ePreloadMode    The compare register 1 preload mode. See @ref qtmr_channel_count_preload_mode_t.
 */
static inline void QTMR_SetCompare1PreloadControl(TMR_Type *base,
                                                  qtmr_channel_number_t eChannelNumber,
                                                  qtmr_channel_count_preload_mode_t ePreloadMode)
{
    base->CHANNEL[eChannelNumber].CSCTRL =
        (base->CHANNEL[eChannelNumber].CSCTRL & (~(uint16_t)TMR_CSCTRL_CL1_MASK)) | TMR_CSCTRL_CL1(ePreloadMode);
}

/*!
 * @brief Sets channel preload mode for compare register 2.
 *
 * This function select channel preload mode for compare register 2. Default the COMP2 register never preload, when
 * enabled, the COMP2 can preload from CMPLD2 register when COMP1 or COMP2 compare event.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param ePreloadMode    The compare register 2 preload mode. See @ref qtmr_channel_count_preload_mode_t.
 */
static inline void QTMR_SetCompare2PreloadControl(TMR_Type *base,
                                                  qtmr_channel_number_t eChannelNumber,
                                                  qtmr_channel_count_preload_mode_t ePreloadMode)
{
    base->CHANNEL[eChannelNumber].CSCTRL =
        (base->CHANNEL[eChannelNumber].CSCTRL & (~(uint16_t)TMR_CSCTRL_CL2_MASK)) | TMR_CSCTRL_CL2(ePreloadMode);
}

/*!
 * @brief Sets channel compare register 1 preload register value.
 *
 * This function set the CMPLD1 register value. The COMP1 can preload from CMPLD1 register when preload mode is not
 * "never preload".
 *
 * @param base             Quad Timer peripheral base address.
 * @param eChannelNumber   Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param u16Comp1Preload  Value for Channel compare register 1 preload register.
 */
static inline void QTMR_SetCompare1PreloadValue(TMR_Type *base,
                                                qtmr_channel_number_t eChannelNumber,
                                                uint16_t u16Comp1Preload)
{
    base->CHANNEL[eChannelNumber].CMPLD1 = u16Comp1Preload;
}

/*!
 * @brief Sets channel compare register 2 preload register value.
 *
 * This function set the CMPLD2 register value. The COMP2 can preload from CMPLD2 register when preload mode is not
 * "never preload".
 *
 * @param base             Quad Timer peripheral base address.
 * @param eChannelNumber   Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param u16Comp2Preload  Value for Channel compare register 2 preload register.
 */
static inline void QTMR_SetCompare2PreloadValue(TMR_Type *base,
                                                qtmr_channel_number_t eChannelNumber,
                                                uint16_t u16Comp2Preload)
{
    base->CHANNEL[eChannelNumber].CMPLD2 = u16Comp2Preload;
}

/*!
 * @brief Sets channel load register value.
 *
 * This function set the LOAD register value. The channel will re-initialize the counter value with this register after
 * counter compare or overflow event.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param u16Load         Value used to initialize the counter after counter compare or overflow event.
 */
static inline void QTMR_SetLoadValue(TMR_Type *base, qtmr_channel_number_t eChannelNumber, uint16_t u16Load)
{
    base->CHANNEL[eChannelNumber].LOAD = u16Load;
}

/*!
 * @brief Sets channel count compare register 1.
 *
 * This function set the COMP1 register value. It use to trigger compare event in count up mode or alternating compare
 * mode.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param u16Comp1        Value for Channel compare register 1.
 */
static inline void QTMR_SetCompare1Value(TMR_Type *base, qtmr_channel_number_t eChannelNumber, uint16_t u16Comp1)
{
    base->CHANNEL[eChannelNumber].COMP1 = u16Comp1;
}

/*!
 * @brief Sets channel count compare register 2.
 *
 * This function set the COMP2 register value. It use to trigger compare event in count down mode or alternating
 * compare mode.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param comp            Value for Channel compare register 2.
 */
static inline void QTMR_SetCompare2Value(TMR_Type *base, qtmr_channel_number_t eChannelNumber, uint16_t u16Comp2)
{
    base->CHANNEL[eChannelNumber].COMP2 = u16Comp2;
}

/*!
 * @brief Gets channel capture register value.
 *
 * This function read the CAPT register value, which store the real-time channel counter value when input capture event.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 *
 * @return  The value captured from the channel counter.
 */
static inline uint16_t QTMR_ReadCaptureValue(TMR_Type *base, qtmr_channel_number_t eChannelNumber)
{
    return base->CHANNEL[eChannelNumber].CAPT;
}

/*!
 * @brief Gets channel hold register value.
 *
 * This function read the HOLD register value, which stores the channel counter's values of specific channels whenever
 * any of the four channels within a module is read.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 *
 * @return The channel counter value when any read operation occurs.
 */
static inline uint16_t QTMR_GetHoldValue(TMR_Type *base, qtmr_channel_number_t eChannelNumber)
{
    return base->CHANNEL[eChannelNumber].HOLD;
}

/*!
 * @brief Sets channel counter register value.
 *
 * This function set the CNTR register value, the channel will start counting based on this value.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param u16Count        The channel counter initialize value.
 */
static inline void QTMR_SetCounterValue(TMR_Type *base, qtmr_channel_number_t eChannelNumber, uint16_t u16Count)
{
    base->CHANNEL[eChannelNumber].CNTR = u16Count;
}

/*!
 * @brief Reads channel counter register value.
 *
 * This function read the CNTR register value, which stores the channel real-time channel counting value. This read
 * operation will trigger HOLD register update.
 *
 * @note User can call the utility macros provided in fsl_common.h to convert ticks to usec or msec.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 *
 * @return The real-time channel counter value.
 */
static inline uint16_t QTMR_GetCounterValue(TMR_Type *base, qtmr_channel_number_t eChannelNumber)
{
    return base->CHANNEL[eChannelNumber].CNTR;
}

/*! @}*/

/*!
 * @name Channel output signal (OFLAG) related Interfaces
 * @{
 */

