nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_qtmr.h
/*!
 * @brief Sets Channel output signal (OFLAG) work mode.
 *
 * This function select channel output signal (OFLAG) work mode base on different channel event.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param eOutputMode     The mode of operation for the OFLAG output signal. See @ref qtmr_channel_output_mode_t.
 */
static inline void QTMR_SetOutputMode(TMR_Type *base,
                                      qtmr_channel_number_t eChannelNumber,
                                      qtmr_channel_output_mode_t eOutputMode)
{
    base->CHANNEL[eChannelNumber].CTRL =
        (base->CHANNEL[eChannelNumber].CTRL & (~(uint16_t)TMR_CTRL_OUTMODE_MASK)) | TMR_CTRL_OUTMODE(eOutputMode);
}

/*!
 * @brief Sets the value of output signal when a force event occurs.
 *
 * This function config the value of output signal when a force event occurs. Force events can be a software command or
 * compare event from a master channel.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param eValue          The value of output signal when force event occur. See
 *                         @ref qtmr_channel_output_value_on_force_t.
 */
static inline void QTMR_SetOutputValueOnForce(TMR_Type *base,
                                              qtmr_channel_number_t eChannelNumber,
                                              qtmr_channel_output_value_on_force_t eValue)
{
    base->CHANNEL[eChannelNumber].SCTRL =
        (base->CHANNEL[eChannelNumber].SCTRL & (~(uint16_t)TMR_SCTRL_VAL_MASK)) | TMR_SCTRL_VAL(eValue);
}

/*!
 * @brief Enables/Disables output signal polarity invert feature.
 *
 * This function enables/disables the invert feature of output signal (OFLAG).
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param bEnable         Enable the feature or not.
 *                        - \b true Invert output signal polarity.
 *                        - \b false No invert for output signal polarity.
 */
static inline void QTMR_EnableOutputInvert(TMR_Type *base, qtmr_channel_number_t eChannelNumber, bool bEnable)
{
    if (bEnable)
    {
        base->CHANNEL[eChannelNumber].SCTRL |= (uint16_t)(TMR_SCTRL_OPS_MASK);
    }
    else
    {
        base->CHANNEL[eChannelNumber].SCTRL &= ~(uint16_t)(TMR_SCTRL_OPS_MASK);
    }
}

/*!
 * @brief Enables software triggers a FORCE command to output signal.
 *
 * This function uses a software command to trigger force event, which can force the current value of SCTRL[VAL] bit to
 * be written to the OFLAG output.
 *
 * @note This function can be called only if the counter is disabled.
 * @code
 *      QTMR_SetOutputValueOnForce(QTMR, kQTMR_Channel0, kQTMR_OutputValueSetOnForce);
 *      QTMR_EnableSwForceOutput(QTMR, kQTMR_Channel0);
 * @endcode
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 */
static inline void QTMR_EnableSwForceOutput(TMR_Type *base, qtmr_channel_number_t eChannelNumber)
{
    base->CHANNEL[eChannelNumber].SCTRL |= (uint16_t)(TMR_SCTRL_FORCE_MASK);
}

/*!
 * @brief Enables/Disables output signal (OFLAG) drive on the external pin feature.
 *
 * This function enables/disables output signal (OFLAG) drive on the external pin feature.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param bEnable         Enable the feature or not.
 *                        - \b true The output signal is driven on the external pin.
 *                        - \b false The external pin is configured as an input.
 */
static inline void QTMR_EnableOutputPin(TMR_Type *base, qtmr_channel_number_t eChannelNumber, bool bEnable)
{
    if (bEnable)
    {
        base->CHANNEL[eChannelNumber].SCTRL |= (uint16_t)(TMR_SCTRL_OEN_MASK);
    }
    else
    {
        base->CHANNEL[eChannelNumber].SCTRL &= ~(uint16_t)(TMR_SCTRL_OEN_MASK);
    }
}

#if defined(TMR_CSCTRL_OFLAG_MASK)
/*!
 * @brief Gets the channel output signal value.
 *
 * This function reads the state of the channel internal OFLAG signal prior to consideration of polarity or debug mode.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 *
 * @return The state of the channel output signal.
 */
static inline uint16_t QTMR_GetOutputFlag(TMR_Type *base, qtmr_channel_number_t eChannelNumber)
{
    return ((base->CHANNEL[eChannelNumber].CSCTRL & TMR_CSCTRL_OFLAG_MASK) >> TMR_CSCTRL_OFLAG_SHIFT);
}
#endif

/*! @}*/

/*!
 * @name Channel cooperation control related Interfaces
 * @{
 */

/*!
 * @brief Enables/Disables channel master mode.
 *
 * This function enables/disables channel master mode.
 * @note Master channel can broadcast compare event to all channels within the module
 *       to re-initialize channel and/or force channel output signal.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param bEnable         Enable the feature or not.
 *                        - \b true Enables channel master mode.
 *                        - \b false Disables channel master mode.
 */
static inline void QTMR_EnableMasterMode(TMR_Type *base, qtmr_channel_number_t eChannelNumber, bool bEnable)
{
    if (bEnable)
    {
        base->CHANNEL[eChannelNumber].SCTRL |= (uint16_t)(TMR_SCTRL_MSTR_MASK);
    }
    else
    {
        base->CHANNEL[eChannelNumber].SCTRL &= ~(uint16_t)(TMR_SCTRL_MSTR_MASK);
    }
}

/*!
 * @brief Enables/Disables force the channel output signal (OFLAG) state by master channel compare event.
 *
 * This function enables/disables the compare event from master channel within the same module to force the state of
 * this channel OFLAG output signal.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param bEnable         Enable the feature or not.
 *                        - \b true Enables OFLAG state to be forced by master channel compare event.
 *                        - \b false Disables OFLAG state to be forced by master channel compare event.
 */
static inline void QTMR_EnableMasterForceOFLAG(TMR_Type *base, qtmr_channel_number_t eChannelNumber, bool bEnable)
{
    if (bEnable)
    {
        base->CHANNEL[eChannelNumber].SCTRL |= (uint16_t)(TMR_SCTRL_EEOF_MASK);
    }
    else
    {
        base->CHANNEL[eChannelNumber].SCTRL &= ~(uint16_t)(TMR_SCTRL_EEOF_MASK);
    }
}

/*!
 * @brief Enables/Disables channel be re-initialized by master channel compare event feature.
 *
 * This function enables/disables the compare event from master channel within the same module to force the
 * re-initialization of this channel.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param bEnable         Enable the feature or not.
 *                        - \b true Enables channel be re-initialized by master channel compare event.
 *                        - \b false Disables channel be re-initialized by master channel compare event.
 */
static inline void QTMR_EnableMasterReInit(TMR_Type *base, qtmr_channel_number_t eChannelNumber, bool bEnable)
{
    if (bEnable)
    {
        base->CHANNEL[eChannelNumber].CTRL |= (uint16_t)(TMR_CTRL_COINIT_MASK);
    }
    else
    {
        base->CHANNEL[eChannelNumber].CTRL &= ~(uint16_t)(TMR_CTRL_COINIT_MASK);
    }
}

/*! @}*/

/*!
 * @name DMA control Interfaces
 * @{
 */

/*!
 * @brief Enables the Quad Timer DMA request according to a provided mask.
 *
 * This function enables the Quad Timer DMA request according to a provided mask. The mask is a logical OR of
 * enumerators members. See @ref _qtmr_channel_dma_enable.
 * This examples shows how to enable compare 1 register preload DMA request and compare 2 register preload DMA request.
 * @code
 *      QTMR_EnableDma((QTMR, kQTMR_Channel0,kQTMR_Compare1PreloadDmaEnable | kQTMR_Compare2PreloadDmaEnable);
 * @endcode
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param u16Mask         The QTMR DMA requests to enable. Logical OR of @ref _qtmr_channel_dma_enable.
 */
static inline void QTMR_EnableDma(TMR_Type *base, qtmr_channel_number_t eChannelNumber, uint16_t u16Mask)
{
    base->CHANNEL[eChannelNumber].DMA |= u16Mask;
}

/*!
 * @brief Disables the Quad Timer DMA request according to a provided mask.
 *
 * This function disables the Quad Timer DMA request according to a provided mask. The mask is a logical OR of
 * enumerators members. See @ref _qtmr_channel_dma_enable.
 * This examples shows how to disable compare 1 register preload DMA request and compare 2 register preload DMA request.
 * @code
 *      QTMR_DisableDma((QTMR, kQTMR_Channel0, kQTMR_Compare1PreloadDmaEnable | kQTMR_Compare2PreloadDmaEnable);
 * @endcode
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param u16Mask         The QTMR DMA requests to disable. Logical OR of @ref _qtmr_channel_dma_enable.
 */
static inline void QTMR_DisableDma(TMR_Type *base, qtmr_channel_number_t eChannelNumber, uint16_t u16Mask)
{
    base->CHANNEL[eChannelNumber].DMA &= ~u16Mask;
}

/*! @}*/

/*!
 * @name Interrupt control Interfaces
 * @{
 */

/*!
 * @brief Enables the Quad Timer interrupts according to a provided mask.
 *
 * This function enables the Quad Timer interrupts according to a provided mask. The mask is a logical OR of
 * enumerators members. See @ref _qtmr_channel_interrupt_enable.
 * This examples shows how to enable compare 1 interrupt and compare 2 interrupt.
 * @code
 *      QTMR_EnableInterrupts((QTMR, kQTMR_Channel0, kQTMR_Compare1InterruptEnable | kQTMR_Compare2InterruptEnable);
 * @endcode
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param u16Mask         The QTMR DMA interrupts to enable. Logical OR of @ref _qtmr_channel_interrupt_enable.
 */
static inline void QTMR_EnableInterrupts(TMR_Type *base, qtmr_channel_number_t eChannelNumber, uint16_t u16Mask)
{
    /*Check if compare, overflow and input dege interrupts need enable*/
    if ((u16Mask & (TMR_SCTRL_TCFIE_MASK | TMR_SCTRL_TOFIE_MASK | TMR_SCTRL_IEFIE_MASK)) != 0U)
    {
        base->CHANNEL[eChannelNumber].SCTRL |=
            u16Mask & (TMR_SCTRL_TCFIE_MASK | TMR_SCTRL_TOFIE_MASK | TMR_SCTRL_IEFIE_MASK);
    }
    /*Check if compare 1 and compare 2 interrupts need enable*/
    if ((u16Mask & (TMR_CSCTRL_TCF1EN_MASK | TMR_CSCTRL_TCF2EN_MASK)) != 0U)
    {
        base->CHANNEL[eChannelNumber].CSCTRL |= u16Mask & (TMR_CSCTRL_TCF1EN_MASK | TMR_CSCTRL_TCF2EN_MASK);
    }
}

/*!
 * @brief Disables the Quad Timer interrupts according to a provided mask.
 *
 * This function disables the Quad Timer interrupts according to a provided mask. The mask is a logical OR of
 * enumerators members. See @ref _qtmr_channel_interrupt_enable.
 * This examples shows how to disable compare 1 interrupt and compare 2 interrupt.
 * @code
 *      QTMR_DisableInterrupts((QTMR, kQTMR_Channel0, kQTMR_Compare1InterruptEnable | kQTMR_Compare2InterruptEnable);
 * @endcode
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param u16Mask         The QTMR DMA interrupts to disable. Logical OR of @ref _qtmr_channel_interrupt_enable.
 */
static inline void QTMR_DisableInterrupts(TMR_Type *base, qtmr_channel_number_t eChannelNumber, uint16_t u16Mask)
{
    /*Check if compare, overflow and input dege interrupts need disable*/
    if ((u16Mask & (TMR_SCTRL_TCFIE_MASK | TMR_SCTRL_TOFIE_MASK | TMR_SCTRL_IEFIE_MASK)) != 0U)
    {
        base->CHANNEL[eChannelNumber].SCTRL &=
            ~(u16Mask & (TMR_SCTRL_TCFIE_MASK | TMR_SCTRL_TOFIE_MASK | TMR_SCTRL_IEFIE_MASK));
    }
    /*Check if compare 1 and compare 2 interrupts need disable*/
    if ((u16Mask & (TMR_CSCTRL_TCF1EN_MASK | TMR_CSCTRL_TCF2EN_MASK)) != 0U)
    {
        base->CHANNEL[eChannelNumber].CSCTRL &= ~(u16Mask & (TMR_CSCTRL_TCF1EN_MASK | TMR_CSCTRL_TCF2EN_MASK));
    }
}

/*! @}*/

/*!
 * @name QTMR channel Status Flag Interfaces
 * @{
 */

/*!
 * @brief Gets the Quad Timer status flags.
 *
 * This function gets all QTMR channel status flags. The flags are returned as the logical OR value of the enumerators
 * @ref _qtmr_channel_status_flags. To check for a specific status, compare the return value with enumerators in the
 * @ref _qtmr_channel_status_flags. For example, to check whether the compare flag set.
 * @code
 *      if((QTMR_GetStatusFlags(QTMR, kQTMR_Channel0) & kQTMR_CompareFlag) != 0U)
 *      {
 * 	        ...
 *      }
 * @endcode
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 *
 * @return The QTMR status flags which is the logical OR of the enumerators @ref _qtmr_channel_status_flags.
 */
static inline uint16_t QTMR_GetStatusFlags(TMR_Type *base, qtmr_channel_number_t eChannelNumber)
{
    return (base->CHANNEL[eChannelNumber].SCTRL & (TMR_SCTRL_TCF_MASK | TMR_SCTRL_TOF_MASK | TMR_SCTRL_IEF_MASK)) |
           (base->CHANNEL[eChannelNumber].CSCTRL & (TMR_CSCTRL_TCF1_MASK | TMR_CSCTRL_TCF2_MASK));
}

/*!
 * @brief Clears the Quad Timer status flags.
 *
 * This function clears QTMR channel status flags with a provide mask. The mask is a logical OR of enumerators
 * @ref _qtmr_channel_status_flags.
 * This examples shows how to clear compare 1 flag and compare 2 flag.
 * @code
 *      QTMR_ClearStatusFlags((QTMR, kQTMR_Channel0, kQTMR_Compare1Flag | kQTMR_Compare2Flag);
 * @endcode
 *
 * @param base            Quad Timer peripheral base address
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t
 * @param u16Mask         The QTMR status flags to clear. Logical OR of @ref _qtmr_channel_status_flags
 */
static inline void QTMR_ClearStatusFlags(TMR_Type *base, qtmr_channel_number_t eChannelNumber, uint16_t u16Mask)
{
    /*Check if compare 1 and compare 2 flags*/
    if ((u16Mask & (TMR_CSCTRL_TCF1_MASK | TMR_CSCTRL_TCF2_MASK)) != 0U)
    {
        base->CHANNEL[eChannelNumber].CSCTRL &= ~(u16Mask & (TMR_CSCTRL_TCF1_MASK | TMR_CSCTRL_TCF2_MASK));
    }
    /*Check if compare, overflow and input dege flags*/
    if ((u16Mask & (TMR_SCTRL_TCF_MASK | TMR_SCTRL_TOF_MASK | TMR_SCTRL_IEF_MASK)) != 0U)
    {
        base->CHANNEL[eChannelNumber].SCTRL &=
            ~(u16Mask & (TMR_SCTRL_TCF_MASK | TMR_SCTRL_TOF_MASK | TMR_SCTRL_IEF_MASK));
    }
}

/*! @}*/

/*!
 * @name QTMR channel debug control Interface
 * @{
 */

/*!
 * @brief Sets channel debug actions.
 *
 * This function selects the certain actions which will perform when the chip entering debug mode.
 *
 * @param base            Quad Timer peripheral base address.
 * @param eChannelNumber  Quad Timer channel number. See @ref qtmr_channel_number_t.
 * @param eDebugMode      The Quad Timer channel actions in response to the chip entering debug mode. See
 *                        @ref qtmr_channel_debug_action_t.
 */
static inline void QTMR_SetDebugActions(TMR_Type *base,
                                        qtmr_channel_number_t eChannelNumber,
                                        qtmr_channel_debug_action_t eDebugMode)
{
    base->CHANNEL[eChannelNumber].CSCTRL =
        (base->CHANNEL[eChannelNumber].CSCTRL & (~(uint16_t)TMR_CSCTRL_DBG_EN_MASK)) | TMR_CSCTRL_DBG_EN(eDebugMode);
}

/*! @}*/

/*!
 * @name QTMR channels enable/disable control Interfaces
 * @{
 */

/*!
 * @brief Enables the Quad Timer channels according to a provided mask.
 *
 * This function enables the Quad Timer channels according to a provided mask. The mask is a logical OR of
 * enumerators @ref _qtmr_channel_enable.
 * This examples shows how to enable channel 0 and channel 1.
 * @code
 *      QTMR_EnableChannels(QTMR, kQTMR_Channel0Enable | kQTMR_Channel1Enable);
 * @endcode
 *
 * @note If one channel has effective count mode, it will start its counter as soon as the channel be enabled.
 *
 * @param base      Quad Timer peripheral base address.
 * @param u16Mask   The QTMR channels to enable. Logical OR of @ref _qtmr_channel_enable.
 */
static inline void QTMR_EnableChannels(TMR_Type *base, uint16_t u16Mask)
{
    /* Enables the channel */
    base->CHANNEL[0].ENBL |= TMR_ENBL_ENBL(u16Mask);
}

/*!
 * @brief Disables the Quad Timer channels according to a provided mask.
 *
 * This function disables the Quad Timer channels according to a provided mask. The mask is a logical OR of
 * enumerators @ref _qtmr_channel_enable.
 * This examples shows how to disable channel 0 and channel 1.
 * @code
 *      QTMR_DisableChannels(QTMR, kQTMR_Channel0Enable | kQTMR_Channel1Enable);
 * @endcode
 *
 * @param base      Quad Timer peripheral base address.
 * @param u16Mask   The QTMR channels to enable. Logical OR of @ref _qtmr_channel_enable.
 */
static inline void QTMR_DisableChannels(TMR_Type *base, uint16_t u16Mask)
{
    /* Disables the channel */
    base->CHANNEL[0].ENBL &= ~TMR_ENBL_ENBL(u16Mask);
}

/*! @}*/

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* _FSL_QTMR_H_ */
